Show / Hide Table of Contents
Namespace IdeaRS.OpenModel.Message
Classes
ErrorMessage
Open Error message
IDEAProgress
Progress Report for IOM
IDEAProgressReport
Data for progress report of IOM
InformationMessage
Open Information message
IOMSettings
IOM Settings
NonConformity
Non-conformity
NonConformityIssue
Non-conformity issue
OpenMessage
Open message base class
OpenMessages
Open messages collection
WarningMessage
Open Warning message
Interfaces
IIOMSettings
interface IIOMSettings
Enums
MessageNumber
Message numbers
NonConformitySeverity
Nonconformity severities